Improve description of providers
